TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0H3216/driverlib/empty_driverlib_src/ti/driverlib/dl_unicommuart.h
/** @addtogroup DL_UART_ERROR
 *  @{
 */
/*!
 * @brief Noise error occurred
 */
#define DL_UART_ERROR_NOISE                            (UNICOMMUART_RXDATA_NERR_SET)

/*!
 * @brief Break error ocurred
 */
#define DL_UART_ERROR_BREAK                            (UNICOMMUART_RXDATA_BRKERR_SET)

/*!
 * @brief Parity error ocurred
 */
#define DL_UART_ERROR_PARITY                           (UNICOMMUART_RXDATA_PARERR_SET)

/*!
 * @brief Framing error ocurred
 */
#define DL_UART_ERROR_FRAMING                          (UNICOMMUART_RXDATA_FRMERR_SET)

/** @}*/

/*! @enum DL_UART_OVERSAMPLING_RATE */
typedef enum {
    /*! Set oversampling rate to 16x */
    DL_UART_OVERSAMPLING_RATE_16X = UNICOMMUART_CTL0_HSE_OVS16,
    /*! Set oversampling rate to 8x */
    DL_UART_OVERSAMPLING_RATE_8X = UNICOMMUART_CTL0_HSE_OVS8,
    /*! Set oversampling rate to 3x.
     * IrDA, Manchester and DALI are not supported when 3x oversampling is
     * enabled. */
    DL_UART_OVERSAMPLING_RATE_3X = UNICOMMUART_CTL0_HSE_OVS3
} DL_UART_OVERSAMPLING_RATE;

/*! @enum DL_UART_PARITY */
typedef enum {
    /*! Enable even parity generation, checks for an even number of 1s */
    DL_UART_PARITY_EVEN = (UNICOMMUART_LCRH_PEN_ENABLE | UNICOMMUART_LCRH_EPS_EVEN),
    /*! Enable odd parity generation, checks for an odd number of 1s */
    DL_UART_PARITY_ODD = (UNICOMMUART_LCRH_PEN_ENABLE | UNICOMMUART_LCRH_EPS_ODD),
    /*! Enable stick parity with a parity bit of '1'
     * When enabled, a permanent '1' is set as parity when transmitting and
     * checked as '1' when receiving data. */
    DL_UART_PARITY_STICK_ONE = (UNICOMMUART_LCRH_PEN_ENABLE | UNICOMMUART_LCRH_SPS_ENABLE | UNICOMMUART_LCRH_EPS_ODD),
    /*! Enable stick parity with a parity bit of '0'
     * When enabled, a permanent '0' is set as parity when transmitting and
     * checked as '0' when receiving data. */
    DL_UART_PARITY_STICK_ZERO = (UNICOMMUART_LCRH_PEN_ENABLE | UNICOMMUART_LCRH_SPS_ENABLE | UNICOMMUART_LCRH_EPS_EVEN),
    /*! Disable parity checking and generation */
    DL_UART_PARITY_NONE = UNICOMMUART_LCRH_PEN_DISABLE
} DL_UART_PARITY;

/*! @enum DL_UART_WORD_LENGTH */
typedef enum {
    /*! Word length is 5 bits */
    DL_UART_WORD_LENGTH_5_BITS = UNICOMMUART_LCRH_WLEN_DATABIT5,
    /*! Word length is 6 bits */
    DL_UART_WORD_LENGTH_6_BITS = UNICOMMUART_LCRH_WLEN_DATABIT6,
    /*! Word length is 7 bits */
    DL_UART_WORD_LENGTH_7_BITS = UNICOMMUART_LCRH_WLEN_DATABIT7,
    /*! Word length is 8 bits */
    DL_UART_WORD_LENGTH_8_BITS = UNICOMMUART_LCRH_WLEN_DATABIT8
} DL_UART_WORD_LENGTH;

/*! @enum DL_UART_MODE */
typedef enum {
    /*! Normal operation */
    DL_UART_MODE_NORMAL = UNICOMMUART_CTL0_MODE_UART,
    /*! Operate in RS485 mode */
    DL_UART_MODE_RS485 = UNICOMMUART_CTL0_MODE_RS485,
    /*! Operate in Idle Line mode */
    DL_UART_MODE_IDLE_LINE = UNICOMMUART_CTL0_MODE_IDLELINE,
    /*! Operate in 9 Bit Address mode */
    DL_UART_MODE_ADDR_9_BIT = UNICOMMUART_CTL0_MODE_ADDR9BIT,
    /*! Operate in ISO7816 Smart Card Support mode */
    DL_UART_MODE_SMART_CARD = UNICOMMUART_CTL0_MODE_SMART,
    /*! Operate in DALI mode */
    DL_UART_MODE_DALI = UNICOMMUART_CTL0_MODE_DALI
} DL_UART_MODE;

/*! @enum DL_UART_DIRECTION */
typedef enum {
    /*! Enable UART transmitter */
    DL_UART_DIRECTION_TX = UNICOMMUART_CTL0_TXE_ENABLE,
    /*! Enable UART receiver */
    DL_UART_DIRECTION_RX = UNICOMMUART_CTL0_RXE_ENABLE,
    /*! Enable UART transmitter and receiver */
    DL_UART_DIRECTION_TX_RX = (UNICOMMUART_CTL0_RXE_ENABLE | UNICOMMUART_CTL0_TXE_ENABLE),
    /*! Disable UART transmitter and receiver */
    DL_UART_DIRECTION_NONE = (UNICOMMUART_CTL0_RXE_DISABLE | UNICOMMUART_CTL0_TXE_DISABLE)
} DL_UART_DIRECTION;

/*! @enum DL_UART_CLOCK */
typedef enum {
    /*! Selects BUSCLK as the clock source */
    DL_UART_CLOCK_BUSCLK = UNICOMMUART_CLKSEL_BUSCLK_SEL_ENABLE,
    /*! Selects MFCLK as the clock source */
    DL_UART_CLOCK_MFCLK = UNICOMMUART_CLKSEL_MFCLK_SEL_ENABLE,
    /*! Selects LFCLK as the clock source */
    DL_UART_CLOCK_LFCLK = UNICOMMUART_CLKSEL_LFCLK_SEL_ENABLE,
    /*! Selects asynchronous LFCLK as the clock source */
    DL_UART_CLOCK_ASYNC_LFCLK = UNICOMMUART_CLKSEL_ASYNC_LFCLK_SEL_ENABLE,
    /*! Selects asynchronous SYSCLK as the clock source */
    DL_UART_CLOCK_ASYNC_SYSCLK = UNICOMMUART_CLKSEL_ASYNC_SYSCLK_SEL_ENABLE,
    /*! Selects asynchronous HFCLK as the clock source */
    DL_UART_CLOCK_ASYNC_HFCLK = UNICOMMUART_CLKSEL_ASYNC_HFCLK_SEL_ENABLE,
    /*! Selects asynchronous PLL as the clock source */
    DL_UART_CLOCK_ASYNC_PLL = UNICOMMUART_CLKSEL_ASYNC_PLL_SEL_ENABLE
} DL_UART_CLOCK;

/*! @enum DL_UART_CLOCK_DIVIDE_RATIO */
typedef enum {
    /*! UART source clock divide ratio set to 1 */
    DL_UART_CLOCK_DIVIDE_RATIO_1 = UNICOMMUART_CLKDIV_RATIO_DIV_BY_1,
    /*! UART source clock divide ratio set to 2 */
    DL_UART_CLOCK_DIVIDE_RATIO_2 = UNICOMMUART_CLKDIV_RATIO_DIV_BY_2,
    /*! UART source clock divide ratio set to 3 */
    DL_UART_CLOCK_DIVIDE_RATIO_3 = UNICOMMUART_CLKDIV_RATIO_DIV_BY_3,
    /*! UART source clock divide ratio set to 4 */
    DL_UART_CLOCK_DIVIDE_RATIO_4 = UNICOMMUART_CLKDIV_RATIO_DIV_BY_4,
    /*! UART source clock divide ratio set to 5 */
    DL_UART_CLOCK_DIVIDE_RATIO_5 = UNICOMMUART_CLKDIV_RATIO_DIV_BY_5,
    /*! UART source clock divide ratio set to 6 */
    DL_UART_CLOCK_DIVIDE_RATIO_6 = UNICOMMUART_CLKDIV_RATIO_DIV_BY_6,
    /*! UART source clock divide ratio set to 7 */
    DL_UART_CLOCK_DIVIDE_RATIO_7 = UNICOMMUART_CLKDIV_RATIO_DIV_BY_7,
    /*! UART source clock divide ratio set to 8 */
    DL_UART_CLOCK_DIVIDE_RATIO_8 = UNICOMMUART_CLKDIV_RATIO_DIV_BY_8
} DL_UART_CLOCK_DIVIDE_RATIO;

/*! @enum DL_UART_FLOW_CONTROL */
typedef enum {
    /*! Enable request to send */
    DL_UART_FLOW_CONTROL_RTS = UNICOMMUART_CTL0_RTSEN_ENABLE,
    /*! Enable clear to send */
    DL_UART_FLOW_CONTROL_CTS = UNICOMMUART_CTL0_CTSEN_ENABLE,
    /*! Enable request to send and clear to send */
    DL_UART_FLOW_CONTROL_RTS_CTS = (UNICOMMUART_CTL0_RTSEN_ENABLE | UNICOMMUART_CTL0_CTSEN_ENABLE),
    /*! Disable flow control */
    DL_UART_FLOW_CONTROL_NONE = (UNICOMMUART_CTL0_CTSEN_DISABLE | UNICOMMUART_CTL0_RTSEN_DISABLE)
} DL_UART_FLOW_CONTROL;

/*! @enum DL_UART_RTS */
typedef enum {
    /*! RTS is asserted indicating data in RX FIFO is below threshold */
    DL_UART_RTS_ASSERT = UNICOMMUART_CTL0_RTS_SET,
    /*! RTS is deasserted indicating data in RX FIFO is at or above threshold */
    DL_UART_RTS_DEASSERT = UNICOMMUART_CTL0_RTS_CLR
} DL_UART_RTS;

/*! @enum DL_UART_STOP_BITS */
typedef enum {
    /*! One stop bit is transmitted at the end of the frame */
    DL_UART_STOP_BITS_ONE = UNICOMMUART_LCRH_STP2_DISABLE,
    /*! Two stop bits are transmitted at the end of the frame */
    DL_UART_STOP_BITS_TWO = UNICOMMUART_LCRH_STP2_ENABLE
} DL_UART_STOP_BITS;

/*! @enum DL_UART_TXD_OUT */
typedef enum {
    /*! TXD pin is low */
    DL_UART_TXD_OUT_LOW = UNICOMMUART_CTL0_TXD_OUT_LOW,
    /*! TXD pin is high */
    DL_UART_TXD_OUT_HIGH = UNICOMMUART_CTL0_TXD_OUT_HIGH
} DL_UART_TXD_OUT;

